example/pod/fio.log
write-device-to-test-4k-seq: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
write-device-to-test-128k-seq: (g=1): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.26
Starting 2 processes

write-device-to-test-4k-seq: (groupid=0, jobs=1): err= 0: pid=96: Mon May  2 10:17:08 2022
  write: IOPS=382, BW=1531KiB/s (1568kB/s)(1794MiB/1200003msec); 0 zone resets
    slat (usec): min=3, max=1121, avg=32.82, stdev=12.86
    clat (usec): min=1098, max=203686, avg=2572.05, stdev=861.10
     lat (usec): min=1119, max=203726, avg=2605.67, stdev=862.79
    clat percentiles (usec):
     |  1.00th=[ 1680],  5.00th=[ 1893], 10.00th=[ 1991], 20.00th=[ 2147],
     | 30.00th=[ 2245], 40.00th=[ 2343], 50.00th=[ 2442], 60.00th=[ 2540],
     | 70.00th=[ 2671], 80.00th=[ 2835], 90.00th=[ 3097], 95.00th=[ 3458],
     | 99.00th=[ 5604], 99.50th=[ 7046], 99.90th=[10814], 99.95th=[13435],
     | 99.99th=[22414]
   bw (  KiB/s): min=   20, max= 3729, per=100.00%, avg=1673.04, stdev=317.68, samples=459364
   iops        : min=    1, max=    1, avg= 1.00, stdev= 0.00, samples=459364
  lat (msec)   : 2=10.49%, 4=86.66%, 10=2.71%, 20=0.12%, 50=0.02%
  lat (msec)   : 250=0.01%
  cpu          : usr=0.70%, sys=2.17%, ctx=459376, majf=0, minf=3695
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,459364,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-device-to-test-128k-seq: (groupid=1, jobs=1): err= 0: pid=97: Mon May  2 10:17:08 2022
  write: IOPS=146, BW=18.3MiB/s (19.2MB/s)(21.5GiB/1200007msec); 0 zone resets
    slat (usec): min=9, max=681, avg=56.94, stdev=15.47
    clat (usec): min=4947, max=95106, avg=6755.19, stdev=1564.96
     lat (usec): min=5006, max=95170, avg=6813.11, stdev=1565.78
    clat percentiles (usec):
     |  1.00th=[ 5604],  5.00th=[ 5800], 10.00th=[ 5932], 20.00th=[ 6063],
     | 30.00th=[ 6194], 40.00th=[ 6325], 50.00th=[ 6521], 60.00th=[ 6652],
     | 70.00th=[ 6849], 80.00th=[ 7046], 90.00th=[ 7439], 95.00th=[ 8225],
     | 99.00th=[12518], 99.50th=[14877], 99.90th=[24511], 99.95th=[30278],
     | 99.99th=[51643]
   bw (  KiB/s): min= 1378, max=26490, per=100.00%, avg=19850.07, stdev=2325.94, samples=175931
   iops        : min=    1, max=    1, avg= 1.00, stdev= 0.00, samples=175931
  lat (msec)   : 10=97.63%, 20=2.15%, 50=0.20%, 100=0.01%
  cpu          : usr=0.43%, sys=1.06%, ctx=175937, majf=0, minf=2646
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,175931,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1531KiB/s (1568kB/s), 1531KiB/s-1531KiB/s (1568kB/s-1568kB/s), io=1794MiB (1882MB), run=1200003-1200003msec

Run status group 1 (all jobs):
  WRITE: bw=18.3MiB/s (19.2MB/s), 18.3MiB/s-18.3MiB/s (19.2MB/s-19.2MB/s), io=21.5GiB (23.1GB), run=1200007-1200007msec

Disk stats (read/write):
  rbd0: ios=150/638002, merge=0/0, ticks=348/2366707, in_queue=2367055, util=100.00%